src/main/resources/xml/roomingListServicePort/saveRoomingListTemplate/saveRoomingListTemplate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:room="http://roomingList.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <room:saveRoomingListTemplate>
         <!--Optional:-->
         <request>
            <!--Optional:-->
            <templateTO>
               <!--Optional:-->
               <templateName>?</templateName>
               <!--Optional:-->
               <createdUpdatedBy>?</createdUpdatedBy>
               <!--Optional:-->
               <defaultNoOfRows>?</defaultNoOfRows>
               <!--Optional:-->
               <templateId>?</templateId>
               <!--Optional:-->
               <lastUsedDate>?</lastUsedDate>
               <!--Optional:-->
               <styleClass>?</styleClass>
               <!--Zero or more repetitions:-->
               <templateFieldList>
                  <!--Optional:-->
                  <defaultValue>?</defaultValue>
                  <!--Optional:-->
                  <fieldSequenceCharacter>?</fieldSequenceCharacter>
                  <!--Optional:-->
                  <styleClass>?</styleClass>
                  <!--Optional:-->
                  <orderNumber>?</orderNumber>
                  <!--Optional:-->
                  <fieldSequenceNumber>?</fieldSequenceNumber>
                  <!--Optional:-->
                  <fieldTO>
                     <!--Optional:-->
                     <fieldId>?</fieldId>
                     <!--Optional:-->
                     <isRepeatable>?</isRepeatable>
                     <!--Optional:-->
                     <defaultFieldIndicator>?</defaultFieldIndicator>
                     <!--Optional:-->
                     <fieldName>?</fieldName>
                     <!--Optional:-->
                     <fieldDataType>?</fieldDataType>
                  </fieldTO>
               </templateFieldList>
            </templateTO>
         </request>
         <context>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </context>
      </room:saveRoomingListTemplate>
   </soapenv:Body>
</soapenv:Envelope>